src/test/resources/FulfillmentShippingOrder_Input_Example.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ord="http://ordermgmt.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <ord:putShippingOrder>
         <shippingId>1234</shippingId>
         <billingAddress>
            <name>Mulesoft</name>
            <line1>77 Geary St</line1>
            <line2>Level 4</line2>
            <city>San Francisco</city>
            <stateOrProvinceCode>CA</stateOrProvinceCode>
            <countryCode>USA</countryCode>
            <postalCode>94108</postalCode>
         </billingAddress>
         <shippingAddress>
            <name>Mulesoft</name>
            <line1>77 Geary St</line1>
            <line2>Level 4</line2>
            <city>San Francisco</city>
            <stateOrProvinceCode>CA</stateOrProvinceCode>
            <countryCode>USA</countryCode>
            <postalCode>94108</postalCode>
         </shippingAddress>
         <order>
            <orderItem>
               <merchantSKU>1234</merchantSKU>
               <quantity>500</quantity>
            </orderItem>
            <orderItem>
               <merchantSKU>6789</merchantSKU>
               <quantity>1500</quantity>
            </orderItem>
            <orderItem>
               <merchantSKU>9998</merchantSKU>
               <quantity>5000</quantity>
            </orderItem>
         </order>
      </ord:putShippingOrder>
   </soapenv:Body>
</soapenv:Envelope>